week2/app/views/microposts/_form.html.erb

SELECT "users"."name" FROM "users"
---
    <%= form.label :user_id %>
    <%= form.select :user_name, User.pluck(:name) %>